export const timeSlots = [
  '08:00 - 09:20',
  '09:30 - 10:50',
  '11:10 - 12:30',
  '13:00 - 14:20',
  '14:40 - 16:00',
  '16:20 - 17:40',
  '18:10 - 19:30',
  '19:40 - 21:00'
];

export const weekDays = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота'];

export const sampleBookings = [
  { id: 13412, date: '18.05.2026', building: 'Костина\n(ул. Костина, 2Б)', room: '113', slot: '08:00 - 09:20', status: 'Активна' },
  { id: 12144, date: '11.03.2026', building: 'Костина\n(ул. Костина, 2Б)', room: '218', slot: '11:10 - 12:30', status: 'Отменена' },
  { id: 8456, date: '02.02.2026', building: 'Костина\n(ул. Костина, 2Б)', room: '112', slot: '08:00 - 09:20', status: 'Завершена' }
];

export const availableRooms = [
  { id: 103, capacity: 32, equipment: 'Компьютер, Проектор, Умная доска' },
  { id: 112, capacity: 24, equipment: 'Компьютер, Проектор, Умная доска' },
  { id: 113, capacity: 24, equipment: 'Компьютер, Проектор, Умная доска' }
];

export const groups = ['22ПИ-3', '22ПИ-2', '23ПИ-1'];
